const express = require('express');
const cors = require('cors');
const bodyParser = require('body-parser');
const multer = require('multer');
const path = require('path');

const app = express();
app.use(cors());
app.use(bodyParser.json());
app.use('/sample_images', express.static(path.join(__dirname, '../public/sample_images')));

const storage = multer.diskStorage({
  destination: (req, file, cb) => {
    cb(null, path.join(__dirname, '../public/sample_images'));
  },
  filename: (req, file, cb) => {
    cb(null, Date.now() + path.extname(file.originalname));
  },
});

const upload = multer({ storage });

let articles = [
    {
        id: 1,
        title: 'Διαβάστε στο «ΠΑΡΟΝ» την Κυριακή: Αιφνιδιασμός με πρόωρες εκλογές',
        content: 'Η Ρωσία κατηγόρησε τις ΗΠΑ ως υπεύθυνες για μια ουκρανική επίθεση που εξαπολύθηκε σήμερα στη Σεβαστούπολη της Κριμαίας, την ουκρανική χερσόνησο που προσαρτήθηκε το 2014 από τη Ρωσία, με πέντε αμερικανικής προέλευσης πυραύλους. Τουλάχιστον πέντε άνθρωποι, μεταξύ των οποίων τρία παιδιά σκοτώθηκαν και άλλοι 124 τραυματίστηκαν από την ουκρανική επίθεση.',
        category: 'Πολιτική',
        imagePath: '/sample_images/1.jpg',
    },
    {
        id: 2,
        title: '«Ο πόλεμος χτυπά την πόρτα μας, στο αδύναμο κομμάτι του Ελληνισμού, την Κύπρο»-Χρ.Καπούτσης',
        content: 'Και στην ερώτηση «Τι θα μπορούσε να κάνει η Χεζμπολάχ που θα ανησυχούσε την Κύπρο;» απάντησε η Αμάλ Σαάντ, συγγραφέας του “Hizbu’llah: Politics and Religion,” στο Al Jazeera ως εξής: «Καταρχάς, θα μπορούσε να κάνει ακριβώς αυτό που απείλησε να κάνει: να χτυπήσει ισραηλινούς στόχους στην Κύπρο. Μια επίθεση “θα ήταν … καταστροφική για την οικονομία της Κύπρου».Ο Πρόεδρος της Κυπριακής Δημοκρατίας, Νίκος Χριστοδουλίδης, σε ερώτηση δημοσιογράφου, αν τον ανησυχούν οι δηλώσεις του Νασράλα,  είπε:  «δεν είναι ευχάριστες οι δηλώσεις, αλλά δεν ανταποκρίνονται σε καμία απολύτως περίπτωση σε αυτό που επιχειρείται, στο να παρουσιαστεί μια εικόνα ότι η Κύπρος εμπλέκεται στις πολεμικές επιχειρήσεις.  Η Κύπρος είναι μέρος της λύσης και όχι μέρος του προβλήματος».',
        category: 'Πολιτισμός',
        imagePath: '/sample_images/2.jpg',
    },
    {
        id: 3,
        title: 'Η χώρα καίγεται ξανά απροετοίμαστη και δεν μετρά μόνο καμμένα στρέμματα αλλά και δεκάδες χαμένα δισεκατομμύρια',
        content: 'Ποιος εκπλήσσεται από τα πύρινα μέτωπα που καίνε και καταστρέφουν φυσικούς πόρους αλλά και περιουσίες ανθρώπων σε όλη τη χώρα; Ποιος δεν γνωρίζει ότι η παρούσα κυβέρνηση έχοντας πάντα ως επιχείρημα το ανείπωτο δράμα στο Μάτι , αρκείται να πατάει το «κουμπάκι» του 112 και να θεωρεί ότι εκεί αρχίζει και τελειώνει ο ρόλος της; Ο κ.Μητσοτάκης και οι άριστοι του δεν μπορούν να κάνουν τίποτα και για τις φωτιές, εκτός βέβαια από το να λένε παραμύθια.΄Όπως αυτό με τα πυροσβεστικά αεροσκάφη που λέει ότι παρήγγειλε . Αυτό που δεν λέει είναι ότι ακόμη δεν υπάρχει καν γραμμή παραγωγής και δεν θα υπάρξει αν οι Καναδοί που θα τα κατασκευάσουν δεν συμπληρώσουν 24 παραγγελίες! Συνεπώς πριν από το 2030 αεροπλάνα μην περιμένετε.',
        category: 'Κόσμος',
        imagePath: '/sample_images/3.jpg',
    },
  ];
  
  app.get('/articles', (req, res) => {
    res.json(articles);
  });
  
  app.post('/articles', (req, res) => {
    const newArticle = { id: articles.length + 1, ...req.body };
    articles.push(newArticle);
    res.status(201).json(newArticle);
  });
  
  app.post('/upload', upload.single('image'), (req, res) => {
    res.json({ path: `/sample_images/${req.file.filename}` });
  });
  
  const PORT = process.env.PORT || 5000;
  app.listen(PORT, () => console.log(`Server running on port ${PORT}`));